app/controllers/users_controller.rb

    def register
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "John Doe"], ["email", "john@email.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 09:01:46.920986"], ["updated_at", "2023-03-23 09:01:46.920986"]]

    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, {username: user_params[:username], email: user_params[:email] }).first
---
SELECT "users".* FROM "users" WHERE (username = 'P_Pogo' OR email = NULL) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]